# My vscode extensions list
DavidAnson.vscode-markdownlint
Gruntfuggly.todo-tree
James-Yu.latex-workshop
VisualStudioExptTeam.intellicode-api-usage-examples
VisualStudioExptTeam.vscodeintellicode
dendron.adjust-heading-level
dendron.dendron
dendron.dendron-markdown-preview-enhanced
dendron.dendron-markdown-shortcuts
dendron.dendron-paste-image
dendron.dendron-snippet-maker
dracula-theme.theme-dracula
jeff-hykin.better-cpp-syntax
josetr.cmake-language-support-vscode 
ms-azuretools.vscode-docker
ms-dotnettools.vscode-dotnet-runtime
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-themes
ms-vscode.remote-explorer
ms-vscode.remote-server
redhat.vscode-yaml
twxs.cmake
vscodevim.vim
yzhang.markdown-all-in-one

